import s from "./About.module.css";
import pic from "../../assets/20241022225030_1.jpg";

const About = () => {
  return (
    <div className={s.container}>
      <h2 className={s.title}>Про мене</h2>
      <div className={s.wrap}>
        <img className={s.pic} src={pic} alt="" />
        <p className={s.text}>
          {`Привіт! Мене звати Ірина, і я рада поділитися своєю історією. Мій
          кар'єрний шлях розпочався ще у 2000-х роках, але все кардинально
          змінилося, коли я залишилася без роботи. Цей період став для мене
          часом переосмислення і нових можливостей. Я вирішила, що хочу
          працювати на себе, створювати щось власне і працювати онлайн. Так я
          відкрила для себе платформу YouTube. З першого ж дня я створила два
          YouTube-канали, змонтувала свої перші відео і завантажила їх. І вже
          через деякий час мої канали почали приносити дохід. Зараз я діючий
          ютубер і працюю в цій сфері вже понад 4 роки. Тепер я готова
          поділитися своїм досвідом із вами! Я навчу вас, як: створювати канал,
          знімати контент, монтувати відео, завантажувати ролики на YouTube. Усе
          це з мінімальними затратами часу, але з можливістю отримувати основний
          чи додатковий дохід. Для старту вам знадобиться лише телефон і доступ
          до інтернету. Почнімо разом вашу подорож у світ YouTube!`}
        </p>
      </div>
      <button className={s.button} type="button">
        Хочу на курс
      </button>
      {/* <div className={s.line}></div> */}
    </div>
  );
};
export default About;
