import s from "./About.module.css";
import pic from "../../assets/2.jpg";

const About = () => {
  return (
    <div className={s.container}>
      <h2 className={s.title}>Про мене</h2>
      <div className={s.wrap}>
        <img className={s.pic} src={pic} alt="about_me" />
        <p className={s.text}>
          Привіт! Мене звати Ірина і я рада поділитися своєю історією. Мій
          кар&apos;єрний шлях почався ще у 2000-х роках, але все кардинально
          змінилося, коли я залишилася без роботи. <br /> Цей період став для
          мене часом переосмислення і нових можливостей. Я вирішила, що хочу
          працювати на себе, створювати щось власне і працювати онлайн. Так я
          відкрила для себе платформу YouTube. <br />
          <br /> З першого ж дня я створила два YouTube-канали, змонтувала свої
          перші відео і завантажила їх. І вже через деякий час мої канали почали
          приносити прибуток. Зараз, я - діючий ютубер і працюю в цій сфері вже
          понад 4 роки. Тепер я готова поділитися своїм досвідом із вами! <br />
          <br /> Я навчу вас, як: <br /> - створювати канал, <br />
          - знімати контент, <br />
          - монтувати відео, <br />
          - завантажувати ролики на YouTube. <br />
          Усе це з мінімальними затратами часу, але з можливістю отримувати
          основний чи додатковий дохід. Для старту вам знадобиться лише телефон
          і доступ до інтернету. Почнімо разом вашу подорож у світ YouTube!
        </p>
      </div>
      <a>
        <button className={s.button} type="button">
          Хочу на курс
        </button>
      </a>
    </div>
  );
};
export default About;
