import s from "./Footer.module.css";
import Modal from "react-modal";

const Footer = ({ isOpen, openModal, closeModal }) => {
  Modal.setAppElement("#root");
  return (
    <footer className={s.container}>
      <a className={s.title} href="#">
        YouTube <span className={s.listLink}>Star</span>
      </a>
      <ul className={s.list}>
        <li className={s.listItem}>
          <p onClick={openModal} className={s.listLink}>
            Політика конфіденційності
          </p>
          <Modal
            isOpen={isOpen}
            onRequestClose={closeModal}
            contentLabel="Image Modal"
            bodyOpenClassName={s.modalOpen}
            style={{
              overlay: {
                backgroundColor: "rgba(0, 0, 0, 0.75)",
                zIndex: 9999,
              },
              content: {
                color: "black",
                maxWidth: "1300px",
                margin: "auto",
                padding: "20px",
                maxHeight: "800px",
                zIndex: 10000,
              },
            }}
          >
            <h2>Загальні положення</h2>
            <p>
              {`Загальні положення Ця Політика Конфіденційності поширюється на
              користувачів веб-сайту SITE (далі -
              Веб-сайт), а також на кінцевого споживача навчальних послуг (далі
              - Замовник) і описує мету та процес збору, використання, обробки,
              передачі та зберігання персональних даних, які Виконавець отримує
              під час використання користувачами або Замовником Веб-сайту.
              Приймаючи дану політику користувачі та/або Замовник підтверджують,
              що ознайомилися з переліком своїх прав як суб'єкта персональних
              даних. Мета збору, використання та обробки персональних даних
              Метою збору, використання та обробки персональних даних є
              забезпечення користувачів та/або Замовника інформацією про
              професійний досвід Виконавця та його навчальні послуги, а також
              належна реалізація договірних відносин між Виконавцем та
              Замовником. Збір та використання персональних даних При
              використанні Веб-сайту здійснюється збір та обробка даних
              користувачів та/або Замовника, а саме: файли cookie; ір-адреси;
              параметри і налаштувань інтернет-браузерів (User-agent);
              персональні дані, що надаються при заповненні реєстраційних форм,
              анкет тощо. Під персональними даними розуміється інформація про
              фізичну особу в розумінні Закону України «Про інформацію»,
              включаючи в тому числі відомості (інформація) про: прізвище, ім’я
              та по-батькові (в разі наявності), місто проживання, номер
              мобільного телефону, адресу скриньки електронної пошти тощо.
              Виконавець збирає лише ті персональні дані, які свідомо і
              добровільно надані користувачами та/або Замовником як суб'єктами
              персональних даних в цілях використання сервісів Веб-сайту, що
              відповідно до вимог законодавства є згодою суб'єкта персональних
              даних на обробку своїх персональних даних відповідно до
              сформульованої в цій Політиці мети. Виконавець не збирає будь-яку
              інформацію, до обробки якої, законодавством встановлені певні
              вимоги, як-то інформацію про расове або етнічне походження,
              політичні, релігійні або світоглядні переконання, членство в
              політичних партіях та професійних спілках, а також даних, що
              стосуються здоров'я, статевого життя, біометричних або генетичних
              даних (відповідно до статті 7 Закону України «Про захист
              персональних даних»). Користувачі Веб-сайту та/або Замовник
              беззастережно заявляють та підтверджують, що вони належним чином
              повідомлені про свої права як суб’єкта персональних даних, мету
              збору, використання та обробки їх персональних даних, коло осіб,
              яким ці дані можуть передаватися та про те, що їх персональні дані
              можуть бути включені до бази даних Виконавця. При відвідуванні
              Веб-сайту можуть фіксуватись всі входи до системи. Інші відомості
              по трафіку не обробляються і не зберігаються. Обробка і
              зберігання персональних даних Обробка і зберігання наданих
              користувачами та/або Замовником персональних даних забезпечуються
              Виконавцем у повній відповідності до вимог чинного законодавства.
              Термін зберігання персональних даних Персональні дані користувачів
              Веб-сайту зберігаються на термін не більше, ніж це необхідно
              відповідно до мети їх обробки. Замовник надає Виконавцю на строк у
              3 (три) роки однозначну та беззаперечну згоду на збір,
              використання, обробку, передачу та зберігання його персональних
              даних з метою здійснення Виконавцем своїх зобов'язань,
              встановлених податковим, статистичним та іншим законодавством
              України, відповідними підзаконними нормативно-правовими актами, а
              також з метою захисту законних прав та інтересів Виконавця.
              Передача інформації третім особам Виконавець повідомляє, що є
              володільцем персональних даних, зібраних у користувачів та/або
              Замовника. Виконавець не здійснює передачу персональних даних
              третім особам, крім випадків, коли така передача є вимогою
              законодавства або є необхідною для належного виконання договірних
              зобов'язань між Замовником і Виконавцем або в інших випадках,
              викладених в цій Політиці. На Веб-сайті можуть бути посилання на
              інші веб-сайти (виключно в інформаційних цілях). При переході по
              посиланню на інші веб-сайти дія цієї Політики на такі сайти не
              поширюється. У зв'язку з чим, Виконавець рекомендує переглядати
              політику в сфері конфіденційності і персональних даних кожного
              веб-сайту перед тим, як передавати будь-які персональні дані, за
              якими Вас можуть ідентифікувати. Захист персональних даних На
              виконання законодавства про захист персональних даних (у т.ч.
              міжнародного законодавства - GDPR ) Веб-сайт гарантує їх безпеку.
              Поширення персональних даних без згоди суб'єкта персональних даних
              або уповноваженої ним особи дозволяється у випадках, визначених
              законом, і лише (якщо це необхідно) в інтересах національної
              безпеки, економічного добробуту та прав людини. Зміна Політики
              Виконавець може вносити зміни у цю Політику конфіденційності, у
              тому числі, при зміні вимог законодавства.`}
            </p>
          </Modal>
        </li>
        <li className={s.listItem}>
          <p onClick={openModal} className={s.listLink}>
            Договір оферти
          </p>
          <Modal
            isOpen={isOpen}
            onRequestClose={closeModal}
            contentLabel="Image Modal"
            bodyOpenClassName={s.modalOpen}
            style={{
              overlay: {
                backgroundColor: "rgba(0, 0, 0, 0.75)",
                zIndex: 9999,
              },
              content: {
                color: "black",
                maxWidth: "1300px",
                margin: "auto",
                padding: "20px",
                maxHeight: "800px",
                zIndex: 10000,
              },
            }}
          >
            <h2>Загальні положення</h2>
            <p>
              {`Загальні положення Ця Політика Конфіденційності поширюється на
              користувачів веб-сайту SITE (далі -
              Веб-сайт), а також на кінцевого споживача навчальних послуг (далі
              - Замовник) і описує мету та процес збору, використання, обробки,
              передачі та зберігання персональних даних, які Виконавець отримує
              під час використання користувачами або Замовником Веб-сайту.
              Приймаючи дану політику користувачі та/або Замовник підтверджують,
              що ознайомилися з переліком своїх прав як суб'єкта персональних
              даних. Мета збору, використання та обробки персональних даних
              Метою збору, використання та обробки персональних даних є
              забезпечення користувачів та/або Замовника інформацією про
              професійний досвід Виконавця та його навчальні послуги, а також
              належна реалізація договірних відносин між Виконавцем та
              Замовником. Збір та використання персональних даних При
              використанні Веб-сайту здійснюється збір та обробка даних
              користувачів та/або Замовника, а саме: файли cookie; ір-адреси;
              параметри і налаштувань інтернет-браузерів (User-agent);
              персональні дані, що надаються при заповненні реєстраційних форм,
              анкет тощо. Під персональними даними розуміється інформація про
              фізичну особу в розумінні Закону України «Про інформацію»,
              включаючи в тому числі відомості (інформація) про: прізвище, ім’я
              та по-батькові (в разі наявності), місто проживання, номер
              мобільного телефону, адресу скриньки електронної пошти тощо.
              Виконавець збирає лише ті персональні дані, які свідомо і
              добровільно надані користувачами та/або Замовником як суб'єктами
              персональних даних в цілях використання сервісів Веб-сайту, що
              відповідно до вимог законодавства є згодою суб'єкта персональних
              даних на обробку своїх персональних даних відповідно до
              сформульованої в цій Політиці мети. Виконавець не збирає будь-яку
              інформацію, до обробки якої, законодавством встановлені певні
              вимоги, як-то інформацію про расове або етнічне походження,
              політичні, релігійні або світоглядні переконання, членство в
              політичних партіях та професійних спілках, а також даних, що
              стосуються здоров'я, статевого життя, біометричних або генетичних
              даних (відповідно до статті 7 Закону України «Про захист
              персональних даних»). Користувачі Веб-сайту та/або Замовник
              беззастережно заявляють та підтверджують, що вони належним чином
              повідомлені про свої права як суб’єкта персональних даних, мету
              збору, використання та обробки їх персональних даних, коло осіб,
              яким ці дані можуть передаватися та про те, що їх персональні дані
              можуть бути включені до бази даних Виконавця. При відвідуванні
              Веб-сайту можуть фіксуватись всі входи до системи. Інші відомості
              по трафіку не обробляються і не зберігаються. Обробка і
              зберігання персональних даних Обробка і зберігання наданих
              користувачами та/або Замовником персональних даних забезпечуються
              Виконавцем у повній відповідності до вимог чинного законодавства.
              Термін зберігання персональних даних Персональні дані користувачів
              Веб-сайту зберігаються на термін не більше, ніж це необхідно
              відповідно до мети їх обробки. Замовник надає Виконавцю на строк у
              3 (три) роки однозначну та беззаперечну згоду на збір,
              використання, обробку, передачу та зберігання його персональних
              даних з метою здійснення Виконавцем своїх зобов'язань,
              встановлених податковим, статистичним та іншим законодавством
              України, відповідними підзаконними нормативно-правовими актами, а
              також з метою захисту законних прав та інтересів Виконавця.
              Передача інформації третім особам Виконавець повідомляє, що є
              володільцем персональних даних, зібраних у користувачів та/або
              Замовника. Виконавець не здійснює передачу персональних даних
              третім особам, крім випадків, коли така передача є вимогою
              законодавства або є необхідною для належного виконання договірних
              зобов'язань між Замовником і Виконавцем або в інших випадках,
              викладених в цій Політиці. На Веб-сайті можуть бути посилання на
              інші веб-сайти (виключно в інформаційних цілях). При переході по
              посиланню на інші веб-сайти дія цієї Політики на такі сайти не
              поширюється. У зв'язку з чим, Виконавець рекомендує переглядати
              політику в сфері конфіденційності і персональних даних кожного
              веб-сайту перед тим, як передавати будь-які персональні дані, за
              якими Вас можуть ідентифікувати. Захист персональних даних На
              виконання законодавства про захист персональних даних (у т.ч.
              міжнародного законодавства - GDPR ) Веб-сайт гарантує їх безпеку.
              Поширення персональних даних без згоди суб'єкта персональних даних
              або уповноваженої ним особи дозволяється у випадках, визначених
              законом, і лише (якщо це необхідно) в інтересах національної
              безпеки, економічного добробуту та прав людини. Зміна Політики
              Виконавець може вносити зміни у цю Політику конфіденційності, у
              тому числі, при зміні вимог законодавства.`}
            </p>
          </Modal>
        </li>
        <li className={s.listItem}>
          <p onClick={openModal} className={s.listLink}>
            Контакти
          </p>
          <Modal
            isOpen={isOpen}
            onRequestClose={closeModal}
            contentLabel="Image Modal"
            bodyOpenClassName={s.modalOpen}
            style={{
              overlay: {
                backgroundColor: "rgba(0, 0, 0, 0.75)",
                zIndex: 9999,
              },
              content: {
                color: "black",
                maxWidth: "1300px",
                margin: "auto",
                padding: "20px",
                maxHeight: "800px",
                zIndex: 10000,
              },
            }}
          >
            <h2>Загальні положення</h2>
            <p>
              {`Загальні положення Ця Політика Конфіденційності поширюється на
              користувачів веб-сайту SITE (далі -
              Веб-сайт), а також на кінцевого споживача навчальних послуг (далі
              - Замовник) і описує мету та процес збору, використання, обробки,
              передачі та зберігання персональних даних, які Виконавець отримує
              під час використання користувачами або Замовником Веб-сайту.
              Приймаючи дану політику користувачі та/або Замовник підтверджують,
              що ознайомилися з переліком своїх прав як суб'єкта персональних
              даних. Мета збору, використання та обробки персональних даних
              Метою збору, використання та обробки персональних даних є
              забезпечення користувачів та/або Замовника інформацією про
              професійний досвід Виконавця та його навчальні послуги, а також
              належна реалізація договірних відносин між Виконавцем та
              Замовником. Збір та використання персональних даних При
              використанні Веб-сайту здійснюється збір та обробка даних
              користувачів та/або Замовника, а саме: файли cookie; ір-адреси;
              параметри і налаштувань інтернет-браузерів (User-agent);
              персональні дані, що надаються при заповненні реєстраційних форм,
              анкет тощо. Під персональними даними розуміється інформація про
              фізичну особу в розумінні Закону України «Про інформацію»,
              включаючи в тому числі відомості (інформація) про: прізвище, ім’я
              та по-батькові (в разі наявності), місто проживання, номер
              мобільного телефону, адресу скриньки електронної пошти тощо.
              Виконавець збирає лише ті персональні дані, які свідомо і
              добровільно надані користувачами та/або Замовником як суб'єктами
              персональних даних в цілях використання сервісів Веб-сайту, що
              відповідно до вимог законодавства є згодою суб'єкта персональних
              даних на обробку своїх персональних даних відповідно до
              сформульованої в цій Політиці мети. Виконавець не збирає будь-яку
              інформацію, до обробки якої, законодавством встановлені певні
              вимоги, як-то інформацію про расове або етнічне походження,
              політичні, релігійні або світоглядні переконання, членство в
              політичних партіях та професійних спілках, а також даних, що
              стосуються здоров'я, статевого життя, біометричних або генетичних
              даних (відповідно до статті 7 Закону України «Про захист
              персональних даних»). Користувачі Веб-сайту та/або Замовник
              беззастережно заявляють та підтверджують, що вони належним чином
              повідомлені про свої права як суб’єкта персональних даних, мету
              збору, використання та обробки їх персональних даних, коло осіб,
              яким ці дані можуть передаватися та про те, що їх персональні дані
              можуть бути включені до бази даних Виконавця. При відвідуванні
              Веб-сайту можуть фіксуватись всі входи до системи. Інші відомості
              по трафіку не обробляються і не зберігаються. Обробка і
              зберігання персональних даних Обробка і зберігання наданих
              користувачами та/або Замовником персональних даних забезпечуються
              Виконавцем у повній відповідності до вимог чинного законодавства.
              Термін зберігання персональних даних Персональні дані користувачів
              Веб-сайту зберігаються на термін не більше, ніж це необхідно
              відповідно до мети їх обробки. Замовник надає Виконавцю на строк у
              3 (три) роки однозначну та беззаперечну згоду на збір,
              використання, обробку, передачу та зберігання його персональних
              даних з метою здійснення Виконавцем своїх зобов'язань,
              встановлених податковим, статистичним та іншим законодавством
              України, відповідними підзаконними нормативно-правовими актами, а
              також з метою захисту законних прав та інтересів Виконавця.
              Передача інформації третім особам Виконавець повідомляє, що є
              володільцем персональних даних, зібраних у користувачів та/або
              Замовника. Виконавець не здійснює передачу персональних даних
              третім особам, крім випадків, коли така передача є вимогою
              законодавства або є необхідною для належного виконання договірних
              зобов'язань між Замовником і Виконавцем або в інших випадках,
              викладених в цій Політиці. На Веб-сайті можуть бути посилання на
              інші веб-сайти (виключно в інформаційних цілях). При переході по
              посиланню на інші веб-сайти дія цієї Політики на такі сайти не
              поширюється. У зв'язку з чим, Виконавець рекомендує переглядати
              політику в сфері конфіденційності і персональних даних кожного
              веб-сайту перед тим, як передавати будь-які персональні дані, за
              якими Вас можуть ідентифікувати. Захист персональних даних На
              виконання законодавства про захист персональних даних (у т.ч.
              міжнародного законодавства - GDPR ) Веб-сайт гарантує їх безпеку.
              Поширення персональних даних без згоди суб'єкта персональних даних
              або уповноваженої ним особи дозволяється у випадках, визначених
              законом, і лише (якщо це необхідно) в інтересах національної
              безпеки, економічного добробуту та прав людини. Зміна Політики
              Виконавець може вносити зміни у цю Політику конфіденційності, у
              тому числі, при зміні вимог законодавства.`}
            </p>
          </Modal>
        </li>
      </ul>
    </footer>
  );
};
export default Footer;
