import s from "./Footer.module.css";
import Modal from "react-modal";

const Footer = ({ isOpen, openModal, closeModal }) => {
  Modal.setAppElement("#root");
  return (
    <footer className={s.container}>
      <a className={s.title} href="#">
        YouTube <span className={s.listLink}>Star</span>
      </a>
      <ul className={s.list}>
        <li className={s.listItem}>
          <p onClick={openModal} className={s.listLink}>
            Політика конфіденційності
          </p>
          <Modal
            isOpen={isOpen}
            onRequestClose={closeModal}
            contentLabel="Image Modal"
            bodyOpenClassName={s.modalOpen}
            style={{
              overlay: {
                backgroundColor: "rgba(0, 0, 0, 0.75)",
                zIndex: 9999,
              },
              content: {
                color: "black",
                maxWidth: "1300px",
                margin: "auto",
                padding: "20px",
                maxHeight: "800px",
                zIndex: 10000,
              },
            }}
          >
            <h2>Загальні положення</h2>
            <p>
              {`Загальні положення Ця Політика Конфіденційності поширюється на
              користувачів веб-сайту SITE (далі -
              Веб-сайт), а також на кінцевого споживача навчальних послуг (далі
              - Замовник) і описує мету та процес збору, використання, обробки,
              передачі та зберігання персональних даних, які Виконавець отримує
              під час використання користувачами або Замовником Веб-сайту.
              Приймаючи дану політику користувачі та/або Замовник підтверджують,
              що ознайомилися з переліком своїх прав як суб'єкта персональних
              даних. Мета збору, використання та обробки персональних даних
              Метою збору, використання та обробки персональних даних є
              забезпечення користувачів та/або Замовника інформацією про
              професійний досвід Виконавця та його навчальні послуги, а також
              належна реалізація договірних відносин між Виконавцем та
              Замовником. Збір та використання персональних даних При
              використанні Веб-сайту здійснюється збір та обробка даних
              користувачів та/або Замовника, а саме: файли cookie; ір-адреси;
              параметри і налаштувань інтернет-браузерів (User-agent);
              персональні дані, що надаються при заповненні реєстраційних форм,
              анкет тощо. Під персональними даними розуміється інформація про
              фізичну особу в розумінні Закону України «Про інформацію»,
              включаючи в тому числі відомості (інформація) про: прізвище, ім’я
              та по-батькові (в разі наявності), місто проживання, номер
              мобільного телефону, адресу скриньки електронної пошти тощо.
              Виконавець збирає лише ті персональні дані, які свідомо і
              добровільно надані користувачами та/або Замовником як суб'єктами
              персональних даних в цілях використання сервісів Веб-сайту, що
              відповідно до вимог законодавства є згодою суб'єкта персональних
              даних на обробку своїх персональних даних відповідно до
              сформульованої в цій Політиці мети. Виконавець не збирає будь-яку
              інформацію, до обробки якої, законодавством встановлені певні
              вимоги, як-то інформацію про расове або етнічне походження,
              політичні, релігійні або світоглядні переконання, членство в
              політичних партіях та професійних спілках, а також даних, що
              стосуються здоров'я, статевого життя, біометричних або генетичних
              даних (відповідно до статті 7 Закону України «Про захист
              персональних даних»). Користувачі Веб-сайту та/або Замовник
              беззастережно заявляють та підтверджують, що вони належним чином
              повідомлені про свої права як суб’єкта персональних даних, мету
              збору, використання та обробки їх персональних даних, коло осіб,
              яким ці дані можуть передаватися та про те, що їх персональні дані
              можуть бути включені до бази даних Виконавця. При відвідуванні
              Веб-сайту можуть фіксуватись всі входи до системи. Інші відомості
              по трафіку не обробляються і не зберігаються. Обробка і
              зберігання персональних даних Обробка і зберігання наданих
              користувачами та/або Замовником персональних даних забезпечуються
              Виконавцем у повній відповідності до вимог чинного законодавства.
              Термін зберігання персональних даних Персональні дані користувачів
              Веб-сайту зберігаються на термін не більше, ніж це необхідно
              відповідно до мети їх обробки. Замовник надає Виконавцю на строк у
              3 (три) роки однозначну та беззаперечну згоду на збір,
              використання, обробку, передачу та зберігання його персональних
              даних з метою здійснення Виконавцем своїх зобов'язань,
              встановлених податковим, статистичним та іншим законодавством
              України, відповідними підзаконними нормативно-правовими актами, а
              також з метою захисту законних прав та інтересів Виконавця.
              Передача інформації третім особам Виконавець повідомляє, що є
              володільцем персональних даних, зібраних у користувачів та/або
              Замовника. Виконавець не здійснює передачу персональних даних
              третім особам, крім випадків, коли така передача є вимогою
              законодавства або є необхідною для належного виконання договірних
              зобов'язань між Замовником і Виконавцем або в інших випадках,
              викладених в цій Політиці. На Веб-сайті можуть бути посилання на
              інші веб-сайти (виключно в інформаційних цілях). При переході по
              посиланню на інші веб-сайти дія цієї Політики на такі сайти не
              поширюється. У зв'язку з чим, Виконавець рекомендує переглядати
              політику в сфері конфіденційності і персональних даних кожного
              веб-сайту перед тим, як передавати будь-які персональні дані, за
              якими Вас можуть ідентифікувати. Захист персональних даних На
              виконання законодавства про захист персональних даних (у т.ч.
              міжнародного законодавства - GDPR ) Веб-сайт гарантує їх безпеку.
              Поширення персональних даних без згоди суб'єкта персональних даних
              або уповноваженої ним особи дозволяється у випадках, визначених
              законом, і лише (якщо це необхідно) в інтересах національної
              безпеки, економічного добробуту та прав людини. Зміна Політики
              Виконавець може вносити зміни у цю Політику конфіденційності, у
              тому числі, при зміні вимог законодавства.`}
            </p>
          </Modal>
        </li>
        <li className={s.listItem}>
          <p onClick={openModal} className={s.listLink}>
            Договір оферти
          </p>
          <Modal
            isOpen={isOpen}
            onRequestClose={closeModal}
            contentLabel="Image Modal"
            bodyOpenClassName={s.modalOpen}
            style={{
              overlay: {
                backgroundColor: "rgba(0, 0, 0, 0.75)",
                zIndex: 9999,
              },
              content: {
                color: "black",
                maxWidth: "1300px",
                margin: "auto",
                padding: "20px",
                maxHeight: "800px",
                zIndex: 10000,
              },
            }}
          >
            <h2>Договір оферти</h2>
            <p>{`Договір публічної оферти
м.Київ, 2024

1. Загальні положення

 

1.1. Фізична особа-підприємець Захарченко Дмитро Вікторович (Дата та номер запису в ЄДР: 02.10.24, 2010350010002010955), іменований надалі «Виконавець» робить пропозицію будь-якій фізичній особі, яка досягла достатнього для акцептування обсягу прав та/або 18 років, надалі іменується «Замовник», укласти цей Договір на визначених умовах, що вказані нижче.

 

1.2. Відповідно до статті 633 Цивільного кодексу України цей Договір є публічною офертою (публічним договором), і в разі прийняття його умов (акцепту) Замовник зобов'язується сумлінно їх виконувати.  

 

1.3. Замовник надає дозвіл Виконавцю на обробку своїх персональних даних відповідно до Закону України «Про захист персональних даних».

 

1.4 Кожна зі Сторін зобов’язується дотримуватися конфіденційності і не надавати третім особам інформацію щодо цього Договору, крім тієї, що є загальнодоступною, технічну та іншу інформацію, отриману від іншої Сторони в процесі виконання цього Договору, без попередньої письмової згоди іншої Сторони, за виключенням випадків, передбачених цим Договором та чинним законодавством України.

 

2. Предмет договору

 

2.1. Виконавець за цим Договором зобов’язується надати Замовнику послуги за обраною ним формою навчання (навчальні програми, вебінари, онлайн та офлайн тренінги тощо), а Замовник зобов’язується оплатити ці послуги у порядку та на умовах, передбачених Договором.

 

2.2. Детальна інформація про форми навчання, їх вартість, порядок розрахунків, а також обсяги, кількість та тривалість занять розміщені на веб-сайті https://www.shoppingsmart.online/ (далі - Веб-сайт).

 

2.3.  Цей Договір не передбачає будь-яких трудових відносин між Виконавцем та  Замовником чи будь-яких відносин роботодавця з найманою особою та не становить будь-яких агентських відносин, які б надавали Замовнику право діяти від імені Виконавця.

 

3. Вартість послуг та порядок розрахунків

 

3.1. Вартість послуги визначається в залежності від обраної Замовником форми навчання на умовах відповідної пропозиції, оприлюдненої на Веб-сайті Виконавця.

 

3.2. В залежності від умов обраної Замовником форми навчання всі платежі за цим Договором можуть здійснюватися наступними способами:

3.2.1. Замовник здійснює оплату через Веб-сайт Виконавця за допомогою сервісу онлайн-транзакцій Portmone шляхом безготівкового переказу на розрахунковий рахунок Виконавця, реквізити якого зазначені в розділі 10 цього Договору;

3.2.2 Замовник заповнює реєстраційну форму, передбачену умовами обраної форми навчання, проходить особисту співбесіду з Виконавцем з метою визначення мотивації та поточного рівня знань і здійснює оплату шляхом безготівкового переказу на розрахунковий рахунок Виконавця, реквізити якого зазначені в розділі 10 цього Договору. Здійснення Замовником дій, перелічених в цьому пункті, вважається акцептом оферти. Виконавець залишає за собою право відмовити Замовнику в укладенні Договору у випадку непроходження Замовником особистої співбесіди.

 

3.3. Факт оплати Замовником послуг за обраною ним формою навчання свідчить про безумовне прийняття ним умов, визначених у цьому Договорі.

 

3.4. Моментом оплати вважається момент зарахування грошових коштів на розрахунковий рахунок Виконавця, реквізити якого зазначені в розділі 10 цього Договору. Виконавець не несе відповідальності за порядок перерахування/зарахування коштів;

 

3.5. Оплата за Договором здійснюється в гривнях та визначається за офіційним курсом гривні до долару США, установленим Національним банком України на дату проведення платежу.

 

3.6. Невідвідування Замовником всіх чи частини занять, передбачених розкладом  проведення занять, який розміщується на Веб-сайті, не є підставою для повернення  Замовнику сплачених за Договором коштів. Норми цього пункту не застосовуються за  умови дострокового розірвання Договору у випадках, передбачених пунктами 9.1 та 9.2  цього Договору.

 

3.7. Повернення Виконавцем Замовнику коштів, сплачених на виконання цього Договору,  здійснюється виключно у випадках, передбачених Договором, шляхом безготівкового переказу на рахунок, з якого здійснювалася оплата за Договором.

 

4. Права та обов’язки Виконавця

 

4.1. Виконавець має право:

4.1.1. Вносити зміни в обсяг форм навчання та/або розклад проведення занять,  попередивши про це Замовника не пізніше ніж за 5 робочих днів. 

4.1.2. На використання робіт Замовника, що були створені у період дії Договору, а також вихідних кодів та матеріалів цих робіт, з ілюстраційною, демонстраційною та рекламною метою, включаючи та не обмежуючись публікацією в мережі Інтернет та використанням у друкованих матеріалах, з обов’язковим зазначенням автора роботи в усіх випадках.

4.1.3 Здійснювати фото- та відеозйомку під час проведення занять без будь-яких обмежень. Замовник також надає Виконавцеві згоду на подальше розміщення таких фото- і відеоматеріалів на Веб-сайті та сторінках Виконавця в соціальних мережах.

 

4.1.4 Здійснювати відеозйомку в місцях проведення занять камерами внутрішнього та зовнішнього відеоспостереження з метою захисту життя та здоров’я Замовника, Виконавця, третіх осіб, а також майна Виконавця від протиправних посягань, без подальшого публічного використання цих відеоматеріалів.

4.1.5. Розірвати цей Договір в односторонньому порядку і припинити надання послуг у випадку невиконання та/або неналежного виконання Замовником зобов’язань за Договором, у разі грубого порушення Замовником дисципліни під час проведення навчання, агресивної поведінки по відношенню до Виконавця або інших Замовників, умисного псування майна Виконавця або у разі відмови Замовника отримувати послуги. У випадку припинення дії Договору за наведеними вище обставинами, сплачені Замовником платежі за цим Договором не повертаються. 

4.1.6. Вимагати від Замовника відшкодування шкоди, заподіяної діями Замовника.

 

4.2. Обов’язки Виконавця:

4.2.1. Надати Замовнику якісно та у повному обсязі послуги за обраною ним формою навчання

4.2.2. Повідомляти Замовника про зміни в обсязі форм навчання та/або розкладі проведення занять, попередивши про це Замовника не пізніше ніж за 5 робочих днів. Таке повідомлення здійснюється шляхом направлення Виконавцем на скриньку електронної пошти Замовника електронного листа з відповідною інформацією.

4.2.3. У випадках, передбачених визначеною на Веб-сайт Виконавця формою навчання, забезпечити Замовника необхідними навчальними та методичними матеріалами.

 

5. Права та обов’язки Замовника

 

5.1. Замовник має право:

5.1.1. На одержання якісних послуг у відповідності до умов цього Договору та вимог, що зазвичай ставляться до послуг такого характеру.

5.1.2. На уважне ставлення до нього, повагу до його честі і гідності з боку Виконавця.

5.1.3. На безпечні умови навчання.

5.1.4. На повідомлення про зміни в обсязі форм навчання та/або розкладі проведення занять за цим Договором у строк, встановлений в пункті 4.2.2. Договору.

 

5.2. Обов’язки Замовника:

5.2.1. Здійснити оплату послуг за цим Договором в порядку та на умовах, встановлених в розділі 3 Договору.

5.2.2. Забезпечити явку для отримання послуг та завчасно повідомляти про свою відсутність на заняттях. Плата за пропущені Замовником заняття, не повертається.

5.2.3. Не передавати третім особам, копіювати або іншим чином використовувати без дозволу Виконавця навчальний та методичний матеріал, що надається Замовнику під час навчання, за винятком його особистого використання;

5.2.5. Дотримуватися дисципліни і загальноприйнятих норм поведінки, зокрема, проявляти повагу до Виконавця, а так само до третіх осіб, яких Виконавець залучає для належного виконання цього Договору, не посягати на їх честь і гідність. 

5.2.6 Не записувати навчальний процес на аудіо- та/або відеоносії. У разі якщо Замовник допустить поширення зазначеної інформації, він несе відповідальність перед Виконавцем за завдані поширенням інформації збитки, включаючи недоотриманий прибуток.

 

6. Права інтелектуальної власності

 

6.1. Сторони погоджуються про те, що усі навчальні матеріали, що використовуватимуться з метою виконання даного Договору, охороняються авторським правом. Ніщо в цьому Договорі не повинно тлумачитись як передача Виконавцем будь-яких майнових прав інтелектуальної власності на навчальні матеріали та/або дозвіл на використання таких  навчальних матеріалів в цілях інших, ніж визначені Договором.

 

6.2. Об’єкти інтелектуальної власності, надані під час реалізації цього Договору Виконавцем, а також усі та будь-які виключні майнові права, в тому числі зазначені у статті 424 Цивільного кодексу України, на об’єкти інтелектуальної власності (авторського права) з моменту створення таких об’єктів у повному обсязі належать Виконавцеві. 

 

7. Строк дії Договору

 

7.1.  Момент набуття чинності Договору залежить від умов відповідної пропозиції, що оприлюднена на Веб-сайті Виконавця для обраної Замовником форми навчання та способу проведення розрахунків:

7.1.1. У випадку проведення розрахунків на умовах, передбачених п.3.2.1. цього Договору, він вважається укладеним з моменту оплати послуг Замовником і діє до повного виконання Сторонами зобов'язань за цим Договором.

7.1.2. У випадку проведення розрахунків на умовах, передбачених п.3.2.2. цього Договору, він вважається укладеним після заповнення Замовником реєстраційної форми, успішного проходження особистої співбесіди з метою визначення мотивації та поточного рівня знань Замовника та здійснення ним оплати послуг і діє до повного виконання Сторонами зобов'язань за цим Договором.

 

7.2. Договір може бути розірваний Виконавцем в односторонньому порядку у випадку, передбаченому п.4.1.5. цього Договору. 

 

7.3. Дострокове розірвання Договору можливе у випадку, передбаченому п.9.5 цього Договору або за взаємною згодою Сторін шляхом укладення між ними у письмовій формі Угоди про розірвання Договору або за рішенням Суду.

 

7.4. У разі дострокового розірвання Договору, сума сплачених Замовником грошових коштів поверненню не підлягає.

 

8. Порядок вирішення спорів

 

8.1. В разі виникнення спорів при виконанні цього Договору Сторони будуть вживати усіх заходів для їх вирішення шляхом переговорів. 

 

8.2. У випадку неможливості врегулювання спорів шляхом переговорів, Замовник або Виконавець має право звернутися до суду відповідної юрисдикції згідно з чинним законодавством України.

 

8.3. Замовник послуг гарантує, що всі умови цього Договору йому зрозумілі, і він приймає їх безумовно і в повному обсязі.

 

9. Обставини непереборної сили

 

9.1. Сторони звільняються від відповідальності за часткове чи повне невиконання зобов'язань за цим Договором, якщо воно стало наслідком обставин непереборної сили, таких як: епідемії, військові події, стихійні лиха, пожежі, повені, страйки, дії державних органів, у тому числі органів виконавчої влади, які перешкоджають нормальній діяльності Виконавця або унеможливлюють виконання Сторонами своїх зобов’язань за цим Договором, інші подібні обставини, якщо вони вплинули на виконання Сторонами цього Договору. Під обставинами непереборної сили треба розуміти обставини, що виникли протягом строку дії цього Договору в результаті непередбачених та невідворотних Сторонами подій. У цих випадках термін виконання Сторонами зобов'язань за договором може бути збільшено відповідно до часу, протягом якого діють такі обставини та їх наслідки. 

 

9.2. Сторона, для якої створилися умови, за яких неможливе виконання зобов'язань за 

договором внаслідок обставин непереборної сили, повинна письмово сповістити іншу сторону про настання цих обставин без жодних зволікань, не пізніше 10-ти днів з дати їх виникнення. Повідомлення повинне містити дані про настання та характер обставин та про їх можливі наслідки шляхом направлення повідомлення на скриньку електронної пошти іншої Сторони. 

 

9.3. У разі виникнення спору належним доказом існування обставин непереборної сили є довідка Торгово-Промислової Палати України або інші докази, передбачені чинним 

законодавством. 

 

9.4. Виникнення зазначених обставин не є підставою для відмови Замовника від плати за послуги, надані до їх виникнення та відмови Виконавця від надання послуг відповідно до проведеної Замовником оплати після припинення їх дії. 

 

9.5. У разі, коли дія обставин непереборної сили триває більше 60 днів, кожна із Сторін має право поставити питання про розірвання цього Договору.


 

10. Реквізити Виконавця

 

Найменування: ФОП Захарченко Дмитро Вікторович

ЕДРПОУ: 3079117752

Веб-сайт: https://www.shoppingsmart.online/

Банк одержувача: Акціонерне товариство УНІВЕРСАЛ БАНК МФО 322001 ЄДРПОУ Банку 21133352`}</p>
          </Modal>
        </li>
        <li className={s.listItem}>
          <p onClick={openModal} className={s.listLink}>
            Контакти
          </p>
          <Modal
            isOpen={isOpen}
            onRequestClose={closeModal}
            contentLabel="Image Modal"
            bodyOpenClassName={s.modalOpen}
            style={{
              overlay: {
                backgroundColor: "rgba(0, 0, 0, 0.75)",
                zIndex: 9999,
              },
              content: {
                color: "black",
                maxWidth: "1300px",
                margin: "auto",
                padding: "20px",
                maxHeight: "800px",
                zIndex: 10000,
              },
            }}
          >
            <h2>Загальні положення</h2>
            <p>
              {`Загальні положення Ця Політика Конфіденційності поширюється на
              користувачів веб-сайту SITE (далі -
              Веб-сайт), а також на кінцевого споживача навчальних послуг (далі
              - Замовник) і описує мету та процес збору, використання, обробки,
              передачі та зберігання персональних даних, які Виконавець отримує
              під час використання користувачами або Замовником Веб-сайту.
              Приймаючи дану політику користувачі та/або Замовник підтверджують,
              що ознайомилися з переліком своїх прав як суб'єкта персональних
              даних. Мета збору, використання та обробки персональних даних
              Метою збору, використання та обробки персональних даних є
              забезпечення користувачів та/або Замовника інформацією про
              професійний досвід Виконавця та його навчальні послуги, а також
              належна реалізація договірних відносин між Виконавцем та
              Замовником. Збір та використання персональних даних При
              використанні Веб-сайту здійснюється збір та обробка даних
              користувачів та/або Замовника, а саме: файли cookie; ір-адреси;
              параметри і налаштувань інтернет-браузерів (User-agent);
              персональні дані, що надаються при заповненні реєстраційних форм,
              анкет тощо. Під персональними даними розуміється інформація про
              фізичну особу в розумінні Закону України «Про інформацію»,
              включаючи в тому числі відомості (інформація) про: прізвище, ім’я
              та по-батькові (в разі наявності), місто проживання, номер
              мобільного телефону, адресу скриньки електронної пошти тощо.
              Виконавець збирає лише ті персональні дані, які свідомо і
              добровільно надані користувачами та/або Замовником як суб'єктами
              персональних даних в цілях використання сервісів Веб-сайту, що
              відповідно до вимог законодавства є згодою суб'єкта персональних
              даних на обробку своїх персональних даних відповідно до
              сформульованої в цій Політиці мети. Виконавець не збирає будь-яку
              інформацію, до обробки якої, законодавством встановлені певні
              вимоги, як-то інформацію про расове або етнічне походження,
              політичні, релігійні або світоглядні переконання, членство в
              політичних партіях та професійних спілках, а також даних, що
              стосуються здоров'я, статевого життя, біометричних або генетичних
              даних (відповідно до статті 7 Закону України «Про захист
              персональних даних»). Користувачі Веб-сайту та/або Замовник
              беззастережно заявляють та підтверджують, що вони належним чином
              повідомлені про свої права як суб’єкта персональних даних, мету
              збору, використання та обробки їх персональних даних, коло осіб,
              яким ці дані можуть передаватися та про те, що їх персональні дані
              можуть бути включені до бази даних Виконавця. При відвідуванні
              Веб-сайту можуть фіксуватись всі входи до системи. Інші відомості
              по трафіку не обробляються і не зберігаються. Обробка і
              зберігання персональних даних Обробка і зберігання наданих
              користувачами та/або Замовником персональних даних забезпечуються
              Виконавцем у повній відповідності до вимог чинного законодавства.
              Термін зберігання персональних даних Персональні дані користувачів
              Веб-сайту зберігаються на термін не більше, ніж це необхідно
              відповідно до мети їх обробки. Замовник надає Виконавцю на строк у
              3 (три) роки однозначну та беззаперечну згоду на збір,
              використання, обробку, передачу та зберігання його персональних
              даних з метою здійснення Виконавцем своїх зобов'язань,
              встановлених податковим, статистичним та іншим законодавством
              України, відповідними підзаконними нормативно-правовими актами, а
              також з метою захисту законних прав та інтересів Виконавця.
              Передача інформації третім особам Виконавець повідомляє, що є
              володільцем персональних даних, зібраних у користувачів та/або
              Замовника. Виконавець не здійснює передачу персональних даних
              третім особам, крім випадків, коли така передача є вимогою
              законодавства або є необхідною для належного виконання договірних
              зобов'язань між Замовником і Виконавцем або в інших випадках,
              викладених в цій Політиці. На Веб-сайті можуть бути посилання на
              інші веб-сайти (виключно в інформаційних цілях). При переході по
              посиланню на інші веб-сайти дія цієї Політики на такі сайти не
              поширюється. У зв'язку з чим, Виконавець рекомендує переглядати
              політику в сфері конфіденційності і персональних даних кожного
              веб-сайту перед тим, як передавати будь-які персональні дані, за
              якими Вас можуть ідентифікувати. Захист персональних даних На
              виконання законодавства про захист персональних даних (у т.ч.
              міжнародного законодавства - GDPR ) Веб-сайт гарантує їх безпеку.
              Поширення персональних даних без згоди суб'єкта персональних даних
              або уповноваженої ним особи дозволяється у випадках, визначених
              законом, і лише (якщо це необхідно) в інтересах національної
              безпеки, економічного добробуту та прав людини. Зміна Політики
              Виконавець може вносити зміни у цю Політику конфіденційності, у
              тому числі, при зміні вимог законодавства.`}
            </p>
          </Modal>
        </li>
      </ul>
    </footer>
  );
};
export default Footer;
